# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php'
tap 'stripe/stripe-cli'

# Binaries
brew 'hcloud'       # Hetzner Cli
brew 'doctl'        # Digital Ocean Cli
brew 'speedtest-cli'    # Speedtest Cli
# brew 'bash'       # Latest Bash version
brew 'bat'          # Used for spatie/visit
brew 'coreutils'    # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'nvm'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'git-secret'
brew 'ncdu'
brew 'rsync'
brew 'ack'
brew 'hub'
brew 'tmux'
brew 'jq'           # Used for spatie/visit
brew 'mackup'
# brew 'mas'          # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts
brew 'zsh-autosuggestions'

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.2'
brew 'php@8.1'
brew 'shivammathur/php/php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'azure-data-studio'
cask 'clickup'
cask 'dbngin'
cask 'discord'
cask 'dbeaver-community'
# cask 'dropzone' # Broken
cask 'figma'
cask 'fig'
cask 'firefox-developer-edition'
cask 'github'
cask 'grammarly'
# cask 'docker'
cask 'google-chrome'
cask 'herd'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'loom'
cask 'microsoft-remote-desktop'
cask 'notion'
# cask 'phpmon'
cask 'ray'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'selfcontrol'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'transmission'
cask 'tuple'
cask 'visual-studio-code'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzip'
cask 'suspicious-package'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-meslo-lg-nerd-font'
cask 'font-meslo-for-powerline'

# Mac App Store # This part is not supported anymore.
# mas 'Amphetamine', id: 937984704
# mas 'Giphy Capture', id: 668208984
# mas 'Everyday Habit Tracker', id: 1394150432
# mas 'Session', id: 1521432881
